var onemsg = [{
  imgurl:'images/file/shu/zhdwm.webp',
  title:'最好的我们 (2019)',
  score:'5.8',
  role:' 陈飞宇 / 何蓝逗 / 惠英红 / 周楚濋 / 蒋紫嫣 / 王初伊 / 陈帅 / 方文强 / 高文峰 / 汪苏泷',
  desc:'每个人的心里大概都藏着一个念念不忘的人。一个偶然被提及的名字，让女摄影师耿耿（何蓝逗 饰）内心掀起万千波澜，触动了回忆的开关，那个撩人心动的少年余淮（陈飞宇 饰）再度闯进她的思绪。 '
}, {
  imgurl:'images/file/shu/hyr.webp',
  title:'黑衣人：全球追缉',
  score:'6.5',
  role:'克里斯·海姆斯沃斯 / 泰莎·汤普森 / 丽贝卡·弗格森 / 库梅尔·南贾尼 / 拉菲·斯波 / 艾玛·汤普森 / 连姆·尼森 / 戴维娜·西塔拉姆 / 纳西尔·贾玛 / 维克托里娅·菲斯 / 佩内洛普·卡普迪雅 / 斯蒂芬·怀特 / 安纳托·陶布曼 / 露丝·霍洛克斯 / 贝恩·科拉科 / 马西·哈里尔 / 哈廷·帕特尔 / 通恰伊·古奈什 / 艾德里安·阿尔瓦拉多 / 史蒂芬·萨姆森 / 曼迪娅·弗罗里 / 黄渤 / 伊隆·马斯克',
  desc:'全球最具影响力的经典科幻IP《黑衣人》全面升级！科幻电影之父史蒂文·斯皮尔伯格联手《速度与激情8》导演F·加里·格雷，金牌班底鼎力巨献！英国黑衣人总部王牌探员H（锤哥）与新晋探员M（泰莎·汤普森）在阻止外星团伙入侵的过程中意外铲除了隐藏在黑衣人组织中的内奸，成功拯救世界 。 '
}, {
  imgurl:'images/file/shu/mgszc.webp',
  title:'妈阁是座城 (2018)',
  score:'5.6',
  role:'白百何 / 黄觉 / 吴刚 / 刘嘉玲 / 梁天 / 钱小豪 / 彭敬慈 / 魏璐 / 耿乐 / 于小彤 / 苏小明 / 胡先煦 / 曾志伟',
  desc:'女叠码仔梅晓鸥（白百何饰）历尽沧桑，在妈阁（澳门）这座赌城中与来历迥异的赌徒打交道，有地产商段凯文（吴刚饰）、有艺术家史奇澜（黄觉饰），也有来自不同阶级的政商人员，连早已堕落低谷的前夫卢晋桐（耿乐饰）都重新卷入她的人生。这些人入赌场就搏杀，出赌场就赖账，女叠码仔过的就是放债和讨债的生活。 '
}, {
  imgurl:'images/file/shu/begbj.webp',
  title:'巴尔干边界 Балканский рубеж (2019)',
  score:'7.3',
  role:'安东·庞布施尼 / 尤里·库琴科 / 米洛斯·比柯维奇 / 米莱纳拉·德罗维奇 / 拉芙珊娜·库珂娃 / 阿勒克山达·斯雷科维奇 / 乔基科·米提克 / 德米特里·弗里德 / 米奥德拉格·拉多尼奇 / 埃米尔·库斯图里卡 / 谢尔盖·马林 / 尼基塔·科洛格利维 / Roman Kurtsyn / 亚历山大·拉多伊契奇 / Efim Petrunin / 安瓦尔·哈里路拉耶夫 / 瓦西利萨·涅姆科娃',
  desc:'1999年, 南斯拉夫。 俄罗斯特遣部队被命令控制科索沃的斯拉蒂纳机场，直到增援部队抵达。但这一战略目标对于阿尔巴尼亚战地指挥官和北约将军来说极为重要。该组织被迫与恐怖分子进行不平等的战斗。俄罗斯维和部队和北约部队正赶往机场。世界再次接近一场大战。但是特别组织的指挥官安德烈 ·沙塔洛夫并不接受政治：在机场，他心爱的女孩亚斯纳是人质之一'
}, {
  imgurl:'images/file/shu/by.webp',
  title:'白牙 Croc-Blanc (2018)',
  score:'7.6',
  role:'拉斐尔·佩尔索纳 / 维尔日妮·埃菲拉 / 多米尼克·皮侬 / 弗朗兹·康菲艾克 / 克莱尔·巴拉达特 / Laurent Natrella / 尼克·奥弗曼 / 拉什达·琼斯 / 保罗·吉亚玛提 / 史蒂芬·克雷默·格利克曼 / 艾迪·斯皮尔斯 / 弗卢拉·博格 / 大卫·博特 / 汤姆·莫顿',
  desc:'故事的主角是一只名叫白牙（尼克·奥弗曼 Nick Offerman 配音）的狼，它自幼生长在弱肉强食的世界之中，早已经习惯了其中的尔虞我诈。长大之后，母亲将白牙带回了主人身边——一位善良强壮的印第安人，就这样，白牙有了一份拉雪橇的工作，日子在平静中一天一天的过去了。 '
}, {
  imgurl:'images/file/shu/gy.webp',
  title:'干预 15 Minutes de Guerre (2019)',
  score:'6.7',
  role:' 欧嘉·柯瑞兰寇 / 文森特·佩雷斯 / 若西安·巴拉斯科',
  desc:'1976年2月，在吉布提，一辆校车在索马里边境被劫持为人质。救援小队必须在30小时内完成救援'
}, {
  imgurl:'images/file/shu/nj.webp',
  title:'女警 걸캅스 (2019)',
  score:'6.5',
  role:' 罗美兰 / 李圣经',
  desc:'讲述虽然是传说中有名的Ace刑警，但在结婚后就到了民怨室工作的美英(罗美兰)和闯祸后被驱逐到民怨室的警察智慧(李圣经)相遇，偶然追赶犯罪事件的喜剧动作故事。'
}, {
    imgurl:'images/file/shu/ym.webp',
    title:'野马 The Mustang (2019)',
    score:'7.4',
    role:'马提亚斯·修奈尔 / 杰森·米切尔 / 布鲁斯·邓恩 / 吉第安·艾朵 / 康妮·布里登 / 乔什·斯图沃特 / 托马斯·史密斯 / 诺尔·古格雷米',
    desc:'法国导演Laure de Clermont-Tonnerre(《纯真曲》《追忆似水年华》)执导并同Mona Fastvold(《战前童年》《梦游者》)和Brock Norman Brock(《国境卫士》《布朗森》)编写剧本，已于内华达开拍。修奈尔饰演一名暴力罪犯Roman Coleman，得到了参与一项康复治疗程序的机会，其中包括训练野蛮的野马。斯图沃特饰演Coleman的狱友，萨兰登饰演监狱的治疗专家，艾朵饰演Coleman的女儿。'
  }, {
    imgurl:'images/file/shu/xm.webp',
    title:'朽木 Deadwood (2019)',
    score:'6.5',
    role:'伊恩·麦柯肖恩 / 蒂莫西·奥利芬特 / 金·迪肯斯 / 布拉德·道里夫 / 莫莉·帕克 / 肖恩·布里吉格斯 / 罗宾·薇格特 / 安娜·冈 / 葆拉·马尔科姆森 / 杰弗瑞·琼斯 / 托尼·库兰 / 约翰·浩克斯 / 杰拉尔德·麦克雷尼 / W·厄尔·布朗 / 威廉·桑德森 / 戴顿·考利 / 杰德·佩蒂约翰 / Geri Jewell / 基内·扬 / Franklyn Ajaye / 杰瑞·坎特莱尔 / 伊戈·米基塔斯 / 范·埃佩尔森 / 哈尔·戴恩',
    desc:'HBO正式宣布电影版[朽木]将于10月开机，有望明春播出。去年便已传出《朽木》编剧大卫·米尔契已完成了电影版剧本。剧版于2004年至2006年播出了三季，但粉丝始终没有迎来最终的大结局，该剧故事围绕美国疆界之外的一个矿镇展开。此前有消息称原剧众卡司均有望回归，包括伊恩·麦柯肖恩、蒂莫西·奥利芬特、约翰·浩克斯、莫莉·帕克、布拉德·道里夫等。'
  }, {
    imgurl:'images/file/shu/fcz.webp',
    title:'复仇者 Avengement (2019)',
    score:'6.7',
    role:'斯科特·阿金斯 / 路易·曼迪勒 / 克雷格·法布拉斯 / 托马斯·图尔格斯 / 尼克·莫兰 / 凯利斯顿·韦勒英 / 里奥·格雷高里 / 特伦斯·梅纳德 / Matt Routledge / Joe Egan / Mark Sears',
    desc:'斯科特·阿金斯饰演的囚犯得到了监狱暂许出行的机会。他找准时机甩掉了监视警察，继续他的复仇之路，让仇人血债血偿。他也借此机会寻找多年前早已迷失的自我，实现自我救赎。'
  }, {
    imgurl:'images/file/shu/amd.webp',
    title:'阿曼达 Amanda (2018)',
    score:'7.3',
    role:'文森特·拉科斯特 / 斯塔西·马汀 / 欧菲莉亚·科尔布 / 玛丽安娜·巴斯莱 / 乔纳森·科恩',
    desc:'Mikhael Hers执导的[阿曼达](Amanda，暂译)将于8月2日开机。该片由斯塔西·马汀([敬畏])、文森特·拉科斯特([希波克拉底])主演。影片故事发生在巴黎，20岁的大卫是个活在当下的空想家，他打各种零工，并且爱上新邻居莱娜。而当他姐姐在一次袭击中遇害，他必须负责照顾7岁的侄女阿曼达。'
  }];
var omlen = onemsg.length;
var html = '';
html = `<div class="rec-file">最新推荐</div>`;
for(let i=0;i<omlen;i++){
  let temp = onemsg[i];
  html += `<div class="pccl-pre">
  <div class="pre-img">
      <img src="${temp.imgurl}" alt="">
  </div>
  <div class="pre-text">
    <p class="pre-t-tit">${temp.title}</p>
    <p class="pre-t-score">观众评分： <span>${temp.score} 分</span></p>
    <p class="pre-t-role fone">主演:  ${temp.role}</p>
    <p class="pre-t-desc fthree">${temp.desc}</p>
  </div>
</div>`;
}
$('.pcc-left').append(html);